1s/ERP/Conf/Documents/Лико_ЗабраковкаОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Лико_ЗабраковкаОснастки</Name>
			<BasedOn>
				<xr:Item>Document.ТС_ЗаявкаНаРемонтРабочихЦентров</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Помещение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладскиеПомещения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>//Технический реквизит, необходим хранения документа основания</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Распоряжение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ТС_ЗаявкаНаРемонтРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказКлиента</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникОбнаружившийБрак</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникПринявшийРешение</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>++ kit:mih web 08.07.21</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоНовыйДокумент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дефект</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_ДефектыОснастки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеДефекта</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Решение</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_РешенияПоБракуОснастки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийКРешению</Name>
							<Comment>++ kit:mih web 08.07.21</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>К2</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУказанияСерий</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснасткаПокупная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЭтоПерваяВыдачаОснастки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пробег</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПисьмоПоРешениюОтправлено</Name>
							<Comment>//++ kit:mih web 14.07.21  - Технический реквизит используется для отслеживания отправлено ли письмо на почту</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодРекламацию</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Форма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_НаработкиОбъектовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_НаработкиОбъектовНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаработкаТекущейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяНаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Rz</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>НомерСекции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЯССМ_ОбъектыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_ВалыФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_ВалыФормы</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Вал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/InformationRegisters/Лико_НаработкиГлубокихФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Лико_НаработкиГлубокихФорм</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаработкаТекущейОперации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбщаяНаработка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Форма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Лико_Формы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаПрихода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ПередачаСоСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ПередачаСоСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПроизводство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Перемещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВРемонт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СОтветственногоХранения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Списание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СписаниеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаПоРаспоряжению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаДругойСклад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаДавальцу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеремещениеНаОтветственноеХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаМОЛ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидыОпераций_ВозвратНаСклад.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидыОпераций_ВозвратНаСклад</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПриходИзПроизводства</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходИзРемонта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВводНачальныхОстатковФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходФорм</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриходПоАктуРазборки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеНаОтветсвенноеХранение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Enums/Лико_ВидОснастки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Лико_ВидОснастки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Штамп</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШтампПлоский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

1s/ERP/Conf/Documents/Лико_ЗабраковкаОснастки/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	Структура = Новый Структура;
	Структура.Вставить("Склад",Объект.Склад);
	Структура.Вставить("Помещение",Объект.Помещение);

	Структура.Вставить("Период",?(ЗначениеЗаполнено(Объект.Дата),Объект.Дата,ТекущаяДата()));
	Структура.Вставить("ТолькоОстатки",Истина);
	
	ОписаниеОповещения=Новый ОписаниеОповещения("ПодборНоменклатурыЗавершение",ЭтаФорма);
	ОткрытьФорму("Справочник.Номенклатура.Форма.Лико_ФормаВыбора_Склад",Структура,,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Суффикс)
	
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	//СтруктураДействий.Вставить("ПересчитатьВесОбъем", Суффикс);
	
КонецФункции

&НаКлиенте
Процедура ПодборНоменклатурыЗавершение(РезультатФормы,ПараметрыФормы) Экспорт 
	
	Если ТипЗнч(РезультатФормы)=Тип("Массив") Тогда
		Для каждого Товар Из РезультатФормы  Цикл
			ТекущаяСтрока = Товар;
			СтруктураДействий = Новый Структура;
			//ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий,"");
			ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения); 
			// Если  ЗначениеЗаполнено(Товар.Серия) Тогда
			//    
			// СтруктураСерии= ПолучитьСтруктуруСерии(Товар.Серия);
			// 
			// 
			//КонецЕсли;
			СтруктураНоменклатуры = Новый Структура;
			СтруктураНоменклатуры.Вставить("Номенклатура");
			//СтруктураНоменклатуры.Вставить("Характеристика");
			СтруктураНоменклатуры.Вставить("Серия");
			
			ЗаполнитьЗначенияСвойств(СтруктураНоменклатуры,Товар);
			Если Объект.Товары.НайтиСтроки(СтруктураНоменклатуры).Количество()=0 Тогда
				НовыйТовар=Объект.Товары.Добавить(); 			 
				
				ЗаполнитьЗначенияСвойств(НовыйТовар,Товар);
				
				//НовыйТовар.АдресХранения=Товар.Ячейка;
				
				
				//НовыйТовар.ХарактеристикиИспользуются=ЗначениеЗаполнено(НовыйТовар.Характеристика);
				НовыйТовар.СтатусУказанияСерий=?(ЗначениеЗаполнено(НовыйТовар.Серия),8,0);
				НовыйТовар.ТипНоменклатуры=Лико_Дополнительно.ЗначениеРеквизитаОбъекта(НовыйТовар.Номенклатура,"ТипНоменклатуры"); 
				
				ДанныеОснастки = ПодучитьДанныеОснастки(НовыйТовар.Серия);
				
				Если ДанныеОснастки.ЭтоПерваяВыдачаОснастки Тогда
					НовыйТовар.Пробег = ПосчитатьПробегОснастки(НовыйТовар.Номенклатура,НовыйТовар.Серия);
				Иначе
					НовыйТовар.Пробег = ДанныеОснастки.Пробег;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ДанныеОснастки.Форма) Тогда
					НовыйТовар.Форма = ДанныеОснастки.Форма;
				КонецЕсли;
								
			КонецЕсли;		
		КонецЦикла;						
		ПослеЗаписиНаСервере();	
	КонецЕсли;
КонецПроцедуры 

&НаСервере
Процедура ПослеЗаписиНаСервере()
	
	УстановитьУсловноеОформление();
	ПриЧтенииСозданииНаСервере()
	
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	
	//НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма); 
	НоменклатураСервер.УстановитьУсловноеОформлениеСерийНоменклатуры(ЭтаФорма, "СерииВсегдаВТЧТовары");
	//НоменклатураСервер.УстановитьУсловноеОформлениеЕдиницИзмерения(ЭтаФорма);
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	ПараметрыУказанияСерий = НоменклатураСервер.ПараметрыУказанияСерий(Объект, Документы.Лико_ЗабраковкаОснастки);
	
	
	СтруктураУстанавливаемыхПараметров = Новый Структура;
	СтруктураУстанавливаемыхПараметров.Вставить("Склад",Объект.Склад);
	
	УстановитьПараметрыФункциональныхОпцийФормы(СтруктураУстанавливаемыхПараметров);
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипНоменклатуры",
	Новый Структура("Номенклатура", "ТипНоменклатуры"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакАртикул",
	Новый Структура("Номенклатура", "Артикул"));
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакТипИзмеряемойВеличины", Новый Структура("Номенклатура", "ТипИзмеряемойВеличины"));
		
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Товары, ПараметрыЗаполненияРеквизитов);
	
		
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект,Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьК2(Команда)
	Для каждого стр Из Объект.Товары Цикл
	
		стр.К2 = Истина;
	
	КонецЦикла; 
КонецПроцедуры


&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	Перем ТекущаяСтрока;
	Перем СтруктураДействий;
	Элементы.Товары.ТекущиеДанные.Серия=Неопределено;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	СтруктураДействий = Новый Структура;
	
	СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
	СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", Новый Структура("Склад, ПараметрыУказанияСерий", Объект.Склад, ПараметрыУказанияСерий));
	
	СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
	ЭтаФорма.ИмяФормы, "Товары"));
	
	ОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриЧтенииСозданииНаСервере();
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда		
		
		НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий); 		
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма); 
	
	////+AttachFiles
	
	payload = Новый Структура;
	payload.Вставить("DocName","Лико_ЗабраковкаОснастки");
	payload.Вставить("DocNumber",Объект.Номер);
	payload.Вставить("DocDate",Объект.Дата); 	
	
	Структура = Новый Структура;
	Структура.Вставить( "action","attach-files");
	Структура.Вставить( "payload",payload);
	Структура.Вставить("ttl",30); 	
	
	Json    = WebSocketСервер.СтруктураВJSON(Структура); 		
	Settings= WebSocketСервер.SettingsTest();
	Token   = WebSocketСервер.ПолучитьToken(Settings);  
	
	ssl      = Новый ЗащищенноеСоединениеOpenSSL();
	
	Массив = Новый Массив();
	Массив.Добавить(Новый Структура("Authorization", СтрШаблон("Bearer %1",Token)));
	
	HttpRespons     = WebSocketСервер.HttpRequest(Settings.domain,Settings.ApiEndPoint_AttachFiles,Json,ssl,,Массив);
	ОтветПотокаJSON = WebSocketСервер.ПолучитьОтветJSON(HttpRespons);		
	
	Если ОтветПотокаJSON.Свойство("uuid") Тогда 
		uuid_=ОтветПотокаJSON.uuid;
		 КодРабочегоМеста=WebSocketСервер.ПолучитьКодРабочегоМеста();

		Урл=WebSocketСервер.url(WebSocketСервер.settingsTest(),Новый Структура("ext,subject",uuid_,КодРабочегоМеста));  	
	КонецЕсли;
	
	url=Урл;
	// Подсистема WebSocket
	ПоказыватьQRCode=Ложь; 
	

	WebSocketСервер.ИнициализацияNew(ЭтаФорма,ПоказыватьQRCode,,WebSocketСервер.SettingsTest(),url);
	// Подсистема WebSocket
	
	////-AttachFiles
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыУказанияСерий(ТекущиеДанныеИдентификатор, ИмяТЧ)
	
	Возврат НоменклатураСервер.ПараметрыФормыУказанияСерий(Объект, ПараметрыУказанияСерий, ТекущиеДанныеИдентификатор, ЭтаФорма);
	
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоСерии(Серия) 	
	//Серия=Справочники.СерииНоменклатуры.СоздатьЭлемент();
	Если Серия.ЯССМ_ОбъектНоменклатуры.Уникальный Тогда
		Количество= Серия.ЯССМ_ОбъектНоменклатуры.Количество;
	Иначе
		Количество=1
	КонецЕсли;
	
	
	Структура = Новый Структура;
	
	Структура.Вставить("Количество",Количество);
	//Структура.Вставить("Упаковка",Серия.ЯССМ_ОбъектНоменклатуры.БазоваяЕдиницаИзмерения);	
	Возврат Структура; 
	
	
КонецФункции

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	
	СкладПриИзмененииСервер();
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииСервер () 
	
	ПриЧтенииСозданииНаСервере();		
	ЗаполнитьСтатусыУказанияСерий();
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьСтатусыУказанияСерий() 
	
	НоменклатураСервер.ЗаполнитьСтатусыУказанияСерий(Объект,ПараметрыУказанияСерий);
	
КонецПроцедуры 

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	
	ОбщегоНазначенияУТКлиент.Провести(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиИЗакрыть(Команда)
	
	ОбщегоНазначенияУТКлиент.ПровестиИЗакрыть(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент(Команда)
		
	ОбщегоНазначенияУТКлиент.Записать(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	ПодключитьОбработчикОжидания("ИзменитьШиринуQR", 2, Истина);
	
КонецПроцедуры  

&НаКлиенте
Процедура ИзменитьШиринуQR()
	
	ЭлементWebSocketURL = Элементы.Найти("WebSocketURL");
	Если ЭлементWebSocketURL <> Неопределено Тогда
		ЭлементWebSocketURL.Ширина = 19;
		ЭлементWebSocketURL.Высота = 10;
	КонецЕсли;
	
КонецПроцедуры

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры


&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПроверитьНеобходимостьИОтправитьПисьмоПоЗабраковкеОснастки();

	Прочитать();
	
	ЭтоНовыйДокумент = Ложь;

	ПослеЗаписиНаСервере();
	ОбновитьИнтерфейс();  
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьНеобходимостьИОтправитьПисьмоПоЗабраковкеОснастки()
	
	Для каждого Строка из Объект.Товары Цикл
		Лико_Дополнительно.ПроверитьНеобходимостьИОтправитьПисьмоПоЗабраковкеМатериалов(Объект.Ссылка,Строка);
	КонецЦикла;	
	
	ПолучитьСообщенияПользователю(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Поле.Имя="ТоварыСерия" Тогда
		Если ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.Серия) Тогда
			Структура = Новый Структура;
			Структура.Вставить("Ключ",Элементы.Товары.ТекущиеДанные.Серия);
			ОткрытьФорму("Справочник.СерииНоменклатуры.ФормаОбъекта",Структура,,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
	//Если Поле.Имя="ТоварыСерияЯССМ_ОбъектНоменклатурыКатегория2" Тогда
	//	ЗапенитьКатегориюНаСервере(Элементы.Товары.ТекущиеДанные.Серия); 		
	//	ОбновитьИнтерфейс();		
	//КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если ЭтоНовыйДокумент И НЕ ЗавершениеРаботы Тогда
		УдалитьДокументНепосредственно(Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры    

&НаСервереБезКонтекста
Процедура УдалитьДокументНепосредственно(СсылкаНаДокумент)
	
	УстановитьПривилегированныйРежим(Истина);
	ДокументОбъект = СсылкаНаДокумент.ПолучитьОбъект();
	ДокументОбъект.Удалить();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
		
	Если ЭтоНовыйДокумент И ЗавершениеРаботы Тогда
		Отказ = Истина;
		ТекстПредупреждения = "Перед закрытием 1С нужно сначала закрыть документ забраковки " + Объект.Номер + ", иначе он ""зависнет""";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыРешениеПриИзменении(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные.Решение = ПредопределенноеЗначение("Справочник.Лико_РешенияПоБракуОснастки.ОграниченноГодныйК2") Тогда
		 Элементы.Товары.ТекущиеДанные.К2 = Истина;
	КонецЕсли;
	 
	Если Элементы.Товары.ТекущиеДанные.ПодРекламацию И Элементы.Товары.ТекущиеДанные.Решение = ПредопределенноеЗначение("Справочник.Лико_РешенияПоБракуОснастки.Списать") Тогда
		ПоказатьПредупреждение(,Новый ФорматированнаяСтрока("Внимание! Оснастка попадает под рекламацию! Прикрепите образцы к забракованному штампу и сдайте в ИК.",Новый Шрифт("Arial",15,Истина)),,"ВНИМАНИЕ!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыДефектПриИзменении(Элемент)
	
	ДанныеОснастки = ПодучитьДанныеОснастки(Элементы.Товары.ТекущиеДанные.Серия);

	Если ДанныеОснастки.ЭтоПерваяВыдачаОснастки Тогда
		Элементы.Товары.ТекущиеДанные.Пробег = ПосчитатьПробегОснастки(Элементы.Товары.ТекущиеДанные.Номенклатура,Элементы.Товары.ТекущиеДанные.Серия);
	Иначе
		Элементы.Товары.ТекущиеДанные.Пробег = ДанныеОснастки.Пробег;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДанныеОснастки.Форма) Тогда
		Элементы.Товары.ТекущиеДанные.Форма = ДанныеОснастки.Форма;
	КонецЕсли;
	
	Если ДанныеОснастки.ОснасткаПокупная 
		И ДанныеОснастки.ЭтоПерваяВыдачаОснастки 
		И Элементы.Товары.ТекущиеДанные.Пробег < 50000 
		И (Элементы.Товары.ТекущиеДанные.Дефект = ПредопределенноеЗначение("Справочник.Лико_ДефектыОснастки.Износ") 
			ИЛИ Элементы.Товары.ТекущиеДанные.Дефект = ПредопределенноеЗначение("Справочник.Лико_ДефектыОснастки.ДефектИзготовления")
			ИЛИ Элементы.Товары.ТекущиеДанные.Дефект = ПредопределенноеЗначение("Справочник.Лико_ДефектыОснастки.НесоответствиеЧертежу")) Тогда
		Элементы.Товары.ТекущиеДанные.ПодРекламацию = Истина;
	Иначе
		Элементы.Товары.ТекущиеДанные.ПодРекламацию = Ложь;
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Функция ПодучитьДанныеОснастки(ОснасткаСерия)

	ДатаПроверки = ?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Дата,ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Остатки.Ячейка КАК Ячейка ИЗ РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Серия = &Серия) КАК Остатки
		|ГДЕ      Остатки.Серия = &Серия";  
	
	Запрос.УстановитьПараметр("Серия",ОснасткаСерия);
	Запрос.УстановитьПараметр("Дата",ДатаПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АдресХранения = Выборка.Ячейка;
		Прервать;
	КонецЦикла;
	
	НаработкаТекОперации = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_ПередачаТоваровТовары.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(Лико_ПередачаТоваровТовары.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаПередачиВПроизводство,
		|	Лико_ПередачаТоваровТовары.Серия КАК Серия
		|ПОМЕСТИТЬ ВТДатаПередачиВПроизводство
		|ИЗ
		|	Документ.Лико_ПередачаТоваров.Товары КАК Лико_ПередачаТоваровТовары
		|ГДЕ
		|	Лико_ПередачаТоваровТовары.Серия = &Серия
		|	И Лико_ПередачаТоваровТовары.Ссылка.Проведен
		|	И НЕ Лико_ПередачаТоваровТовары.Ссылка.ПометкаУдаления
		|	И Лико_ПередачаТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ПередачаСоСклада.ПередачаВПроизводство)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаПередачиВПроизводство УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Лико_ВозвратТоваровТовары.Ссылка КАК Ссылка,
		|	ЕСТЬNULL(Лико_ВозвратТоваровТовары.Ссылка.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаВозвратаИзПроизводства,
		|	Лико_ВозвратТоваровТовары.Серия КАК Серия
		|ПОМЕСТИТЬ ВТДатаВозвратаНаСклад
		|ИЗ
		|	Документ.Лико_ВозвратТоваров.Товары КАК Лико_ВозвратТоваровТовары
		|ГДЕ
		|	Лико_ВозвратТоваровТовары.Ссылка.Проведен
		|	И НЕ Лико_ВозвратТоваровТовары.Ссылка.ПометкаУдаления
		|	И Лико_ВозвратТоваровТовары.Серия = &Серия
		|	И Лико_ВозвратТоваровТовары.Ссылка.ВидОперации = ЗНАЧЕНИЕ(Перечисление.Лико_ВидыОпераций_ВозвратНаСклад.ПриходИзПроизводства)
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДатаВозвратаИзПроизводства УБЫВ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВТДатаВозвратаНаСклад.ДатаВозвратаИзПроизводства, ДАТАВРЕМЯ(1, 1, 1)) < ЕСТЬNULL(ВТДатаПередачиВПроизводство.ДатаПередачиВПроизводство, ДАТАВРЕМЯ(1, 1, 1)) КАК УчитыватьТекущуюНаработку
		|ИЗ
		|	ВТДатаПередачиВПроизводство КАК ВТДатаПередачиВПроизводство
		|		ПОЛНОЕ СОЕДИНЕНИЕ ВТДатаВозвратаНаСклад КАК ВТДатаВозвратаНаСклад
		|		ПО ВТДатаПередачиВПроизводство.Серия = ВТДатаВозвратаНаСклад.Серия";
	
	Запрос.УстановитьПараметр("Серия", ОснасткаСерия);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ВыборкаДетальныеЗаписи.УчитыватьТекущуюНаработку Тогда
			НаработкаТекОперации = Лико_Дополнительно.ПолучитьПробегШтампаПоДаннымСчетчика(ОснасткаСерия, ДатаПроверки, АдресХранения, Ложь);
		Иначе
			НаработкаТекОперации = 0;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЯССМ_ОбъектыНоменклатуры.Категория2 КАК К2,
		|	ВЫБОР
		|		КОГДА Лико_ПараметрыШтампа.ВидРабот = &ВидРаботКонгрев
		|				И ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПоРаппорту, 0) <> 0
		|				И Лико_ПараметрыШтампа.ЭтикетокНаЛисте <> 0
		|				И Лико_ПараметрыШтампа.Ручьи <> 0
		|			ТОГДА (ЕСТЬNULL(Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка, 0) + &НаработкаТекОперации) / (Лико_ПараметрыШтампа.ЭтикетокНаЛисте / Лико_ПараметрыШтампа.Ручьи) * Лико_ПараметрыШтампа.ШагПоРаппорту
		|		КОГДА ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПечати, 0) <> 0
		|			ТОГДА (ЕСТЬNULL(Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка, 0) + &НаработкаТекОперации) / Лико_ПараметрыШтампа.ШагПечати
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Удары,
		|	Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбщаяНаработка КАК Пробег,
		|	ЯССМ_ОбъектыНоменклатуры.ПриходныйОрдер КАК ПриходныйОрдер,
		|	ЕСТЬNULL(Лико_НаработкиГлубокихФормСрезПоследних.ОбщаяНаработка, 0) КАК ПробегГлубокихВалов,
		|	ВидОснастки.Значение КАК ВидОснастки,
		|	ВидШтампаВала.Значение КАК ВидШтампа,
		|	Лико_ВалыФормыСрезПоследних.Форма КАК Форма
		|ИЗ
		|	Справочник.ЯССМ_ОбъектыНоменклатуры КАК ЯССМ_ОбъектыНоменклатуры
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НаработкиОбъектовНоменклатуры.СрезПоследних КАК Лико_НаработкиОбъектовНоменклатурыСрезПоследних
		|		ПО ЯССМ_ОбъектыНоменклатуры.Ссылка = Лико_НаработкиОбъектовНоменклатурыСрезПоследних.ОбъектНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|		ПО ЯССМ_ОбъектыНоменклатуры.Номенклатура = Лико_ПараметрыШтампа.Номенклатура
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_ВалыФормы.СрезПоследних КАК Лико_ВалыФормыСрезПоследних
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Лико_НаработкиГлубокихФорм.СрезПоследних КАК Лико_НаработкиГлубокихФормСрезПоследних
		|			ПО Лико_ВалыФормыСрезПоследних.Вал = Лико_НаработкиГлубокихФормСрезПоследних.Вал
		|				И Лико_ВалыФормыСрезПоследних.Форма = Лико_НаработкиГлубокихФормСрезПоследних.Форма
		|				И (НАЧАЛОПЕРИОДА(Лико_ВалыФормыСрезПоследних.Период, ДЕНЬ) = НАЧАЛОПЕРИОДА(Лико_НаработкиГлубокихФормСрезПоследних.ДатаПрихода, ДЕНЬ))
		|		ПО ЯССМ_ОбъектыНоменклатуры.Номенклатура = Лико_ВалыФормыСрезПоследних.Вал
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ВидОснастки
		|		ПО ЯССМ_ОбъектыНоменклатуры.Номенклатура = ВидОснастки.Ссылка
		|			И (ВидОснастки.Свойство.Имя = ""ОснасткаВид"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ВидШтампаВала
		|		ПО ЯССМ_ОбъектыНоменклатуры.Номенклатура = ВидШтампаВала.Ссылка
		|			И (ВидШтампаВала.Свойство.Имя = ""ОстасткаВидШтампа"")
		|ГДЕ
		|	ЯССМ_ОбъектыНоменклатуры.Серия = &ОснасткаСерия";
	
	Запрос.УстановитьПараметр("ВидРаботКонгрев", Справочники.ВидыРаботСотрудников.Конгрев);
	Запрос.УстановитьПараметр("ОснасткаСерия", ОснасткаСерия);
	Запрос.УстановитьПараметр("НаработкаТекОперации", НаработкаТекОперации);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура = Новый Структура();
		Структура.Вставить("К2",ВыборкаДетальныеЗаписи.К2);
		
		Если ВыборкаДетальныеЗаписи.ПробегГлубокихВалов > 0 
			И ВыборкаДетальныеЗаписи.ВидОснастки = Перечисления.Лико_ВидОснастки.Вал 
			И ВыборкаДетальныеЗаписи.ВидШтампа = Справочники.Лико_ВидШтампа.ГлубокаяПечать Тогда
			Структура.Вставить("Пробег",ВыборкаДетальныеЗаписи.ПробегГлубокихВалов);
			Структура.Вставить("ЭтоПерваяВыдачаОснастки",Ложь);
			Структура.Вставить("Форма",ВыборкаДетальныеЗаписи.Форма);
		ИначеЕсли ВыборкаДетальныеЗаписи.ВидОснастки = Перечисления.Лико_ВидОснастки.Вал 
			И ВыборкаДетальныеЗаписи.ВидШтампа = Справочники.Лико_ВидШтампа.ГлубокаяПечать Тогда
			Структура.Вставить("ЭтоПерваяВыдачаОснастки",Истина);
			Структура.Вставить("Форма",ВыборкаДетальныеЗаписи.Форма);
		ИначеЕсли ТипЗнч(ВыборкаДетальныеЗаписи.Пробег) = Тип("Null") Тогда
			Структура.Вставить("ЭтоПерваяВыдачаОснастки",Истина);
			Структура.Вставить("Форма",Неопределено);
		Иначе
			Структура.Вставить("Пробег",ВыборкаДетальныеЗаписи.Удары);
			Структура.Вставить("ЭтоПерваяВыдачаОснастки",Ложь); 
			Структура.Вставить("Форма",Неопределено);
		КонецЕсли;
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПриходныйОрдер) Тогда
			Структура.Вставить("ОснасткаПокупная",Истина);
		Иначе
			Структура.Вставить("ОснасткаПокупная",Ложь); 
		КонецЕсли;

	КонецЦикла;
	
	Возврат Структура;

КонецФункции 

&НаСервере
Функция ПосчитатьПробегОснастки(Номенклатура,ОснасткаСерия)
	
	ДатаПроверки = ?(ЗначениеЗаполнено(Объект.Ссылка),Объект.Дата,ТекущаяДата());
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Остатки.Ячейка КАК Ячейка ИЗ РегистрНакопления.ТоварыВЯчейках.Остатки(&Дата, Серия = &Серия) КАК Остатки
		|ГДЕ      Остатки.Серия = &Серия";  
	
	Запрос.УстановитьПараметр("Серия",ОснасткаСерия);
	Запрос.УстановитьПараметр("Дата",ДатаПроверки);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		АдресХранения = Выборка.Ячейка;
		Прервать;
	КонецЦикла;  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА Лико_ПараметрыШтампа.ВидРабот = &ВидРаботКонгрев
		|					И ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПоРаппорту, 0) <> 0
		|					И Лико_ПараметрыШтампа.ЭтикетокНаЛисте <> 0
		|					И Лико_ПараметрыШтампа.Ручьи <> 0
		|				ТОГДА ЕСТЬNULL(&НаработкаТекОперации, 0) / (Лико_ПараметрыШтампа.ЭтикетокНаЛисте / Лико_ПараметрыШтампа.Ручьи) * Лико_ПараметрыШтампа.ШагПоРаппорту
		|			КОГДА ВидОснастки.Значение = ЗНАЧЕНИЕ(Перечисление.Лико_ВидОснастки.Вал)
		|					И ВидШтампаВала.Значение = ЗНАЧЕНИЕ(Справочник.Лико_ВидШтампа.ГлубокаяПечать)
		|				ТОГДА ЕСТЬNULL(&НаработкаТекОперации, 0)
		|			КОГДА ЕСТЬNULL(Лико_ПараметрыШтампа.ШагПечати, 0) <> 0
		|				ТОГДА ЕСТЬNULL(&НаработкаТекОперации, 0) / Лико_ПараметрыШтампа.ШагПечати
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Удары
		|ИЗ
		|	РегистрСведений.Лико_ПараметрыШтампа КАК Лико_ПараметрыШтампа
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ВидШтампаВала
		|		ПО Лико_ПараметрыШтампа.Номенклатура = ВидШтампаВала.Ссылка
		|			И (ВидШтампаВала.Свойство.Имя = ""ОстасткаВидШтампа"")
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.ДополнительныеРеквизиты КАК ВидОснастки
		|		ПО Лико_ПараметрыШтампа.Номенклатура = ВидОснастки.Ссылка
		|			И (ВидОснастки.Свойство.Имя = ""ОснасткаВид"")
		|ГДЕ
		|	Лико_ПараметрыШтампа.Номенклатура = &Номенклатура";
	
	Запрос.УстановитьПараметр("ВидРаботКонгрев", Справочники.ВидыРаботСотрудников.Конгрев);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НаработкаТекОперации", Лико_Дополнительно.ПолучитьПробегШтампаПоДаннымСчетчика(ОснасткаСерия, ДатаПроверки, АдресХранения, Ложь));

	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Пробег = ВыборкаДетальныеЗаписи.Удары;
	КонецЦикла;
	
	Возврат Пробег;
	
КонецФункции
